Tekla Open API Reference for Tekla Structures 2025
PolygonNode.Clone Method
 Creates a new object that is a copy of the current instance.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IGeometryNode Clone()
Public Function Clone As IGeometryNode
Return Value
Type: IGeometryNode
A new object that is a copy of the current instance.
Implements
IGeometryNode.Clone()
See Also
Reference
PolygonNode Class
Tekla.Structures.Model Namespace